using System;

namespace ConsoleApp3
{
    class Program
    {
        static void Main(string[] args)
        {
            /*==========================================================
            // א. לכתוב פעולה המקבלת מספר ומחזירה את סכום הספרות שלו
            // ב. לכתוב פעולה המקבל מערך ובעזרת הפעולה מסעיף א מוצאת 
            // את סכום הספרות המקסימלי שיש במערך ומחזירה אותו כנתון
            // ג. לכתוב תכנית המגדירה מערך ובעזרת הפועלה מסעיף ב מדפיסה 
            // את כל איברי המערך כאשר ליד המספרים בעלי סכום הספרות המקסימלי יש גם *
            ===========================================================*/
        }
    }
}
